In [3]:
import pandas as pd

In [4]:
# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [18]:
numbers = pd.Series([4,8,15,16,23,42])

In [19]:
print(numbers)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [20]:
# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
# variable print it.

In [25]:
x = [i for i in range(0,20) if i%2==0]

In [26]:
len(x)

10

In [38]:
even_series = pd.Series(x,name="even_numbers")

In [39]:
print(even_series)

0     0
1     2
2     4
3     6
4     8
5    10
6    12
7    14
8    16
9    18
Name: even_numbers, dtype: int64

In [29]:
# Q3. Create a Pandas DataFrame that contains the following data:
# Then, print the DataFrame.

In [30]:
data = {
    "Name" : ["Alice","Bob","Claire"],
    "Age" : [25,30,27],
    "Gender" : ["Female","Male","Female"]
}

In [31]:
df = pd.DataFrame(data)

In [32]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [33]:
# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [34]:
print("DataFrame is a two-dimensional labeled data structure that is widely used for data manipulation and analysis. It can be thought of as a table or a spreadsheet-like data structure where data is organized in rows and columns.")

DataFrame is a two-dimensional labeled data structure that is widely used for data manipulation and analysis. It can be thought of as a table or a spreadsheet-like data structure where data is organized in rows and columns.

In [36]:
d1 = {'Name': ['John', 'Emma', 'Peter'],
        'Age': [25, 28, 32],
        'City': ['New York', 'London', 'Paris']}
df = pd.DataFrame(d1)
df

    Name  Age      City
0   John   25  New York
1   Emma   28    London
2  Peter   32     Paris

In [35]:
print("Series is a one-dimensional labeled data structure in pandas. It can be thought of as a single column of a DataFrame. It is often used to represent a single variable or feature of a dataset.")

Series is a one-dimensional labeled data structure in pandas. It can be thought of as a single column of a DataFrame. It is often used to represent a single variable or feature of a dataset.

In [37]:
ages = pd.Series([25, 28, 32], name='Age')
print(ages)

0    25
1    28
2    32
Name: Age, dtype: int64

In [40]:
# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
# you give an example of when you might use one of these functions?

In [42]:
print("Some Common Functions Are:")
print("""
head(),
tail(),
info(),
describe(),
sort_values(),
groupby()
""")

Some Common Functions Are:

head(),
tail(),
info(),
describe(),
sort_values(),
groupby()

In [46]:
df.head()

    Name  Age      City
0   John   25  New York
1   Emma   28    London
2  Peter   32     Paris

In [47]:
df.tail()

    Name  Age      City
0   John   25  New York
1   Emma   28    London
2  Peter   32     Paris

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [49]:
df.describe()

             Age
count   3.000000
mean   28.333333
std     3.511885
min    25.000000
25%    26.500000
50%    28.000000
75%    30.000000
max    32.000000

In [50]:
# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [51]:
print("Both Series and Dataframe are mutable in nature")

Both Series and Dataframe are mutable in nature

In [52]:
# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [53]:
d2 = {
    "Name" : pd.Series(["A","B","C"]),
    "Age" : pd.Series([21,22,23]),
    "Marks" : pd.Series([88,90,98])
}

In [54]:
df2 = pd.DataFrame(d2)

In [55]:
df2

  Name  Age  Marks
0    A   21     88
1    B   22     90
2    C   23     98